> did you correctly specify the billing id and auth token? if so, please run it with TF_LOG=DEBUG to increase verbosity

this is the log I dont really understand, billing account id and token already correct:

```
TF_LOG=DEBUG  terraform -chdir=terraform/ apply --auto-approve
2024-01-25T14:29:27.476+0700 [INFO]  Terraform version: 1.6.6
2024-01-25T14:29:27.477+0700 [DEBUG] using github.com/hashicorp/go-tfe v1.36.0
2024-01-25T14:29:27.477+0700 [DEBUG] using github.com/hashicorp/hcl/v2 v2.19.1
2024-01-25T14:29:27.477+0700 [DEBUG] using github.com/hashicorp/terraform-svchost v0.1.1
2024-01-25T14:29:27.477+0700 [DEBUG] using github.com/zclconf/go-cty v1.14.1
2024-01-25T14:29:27.477+0700 [INFO]  Go runtime version: go1.21.5
2024-01-25T14:29:27.477+0700 [INFO]  CLI args: []string{"terraform", "-chdir=terraform/", "apply", "--auto-approve"}
2024-01-25T14:29:27.477+0700 [DEBUG] Attempting to open CLI config file: /Users/michael/.terraformrc
2024-01-25T14:29:27.477+0700 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2024-01-25T14:29:27.477+0700 [INFO]  Loading CLI configuration from /Users/michael/.terraform.d/credentials.tfrc.json
2024-01-25T14:29:27.477+0700 [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2024-01-25T14:29:27.477+0700 [DEBUG] ignoring non-existing provider search directory /Users/michael/.terraform.d/plugins
2024-01-25T14:29:27.477+0700 [DEBUG] ignoring non-existing provider search directory /Users/michael/Library/Application Support/io.terraform/plugins
2024-01-25T14:29:27.477+0700 [DEBUG] ignoring non-existing provider search directory /Library/Application Support/io.terraform/plugins
2024-01-25T14:29:27.477+0700 [INFO]  CLI command args: []string{"apply", "--auto-approve"}
2024-01-25T14:29:27.478+0700 [DEBUG] New state was assigned lineage "f22ef1d5-b226-e370-a66d-8699959d32ff"
2024-01-25T14:29:27.491+0700 [DEBUG] checking for provisioner in "."
2024-01-25T14:29:27.492+0700 [DEBUG] checking for provisioner in "/usr/local/bin"
2024-01-25T14:29:27.493+0700 [INFO]  backend/local: starting Apply operation
2024-01-25T14:29:27.494+0700 [DEBUG] created provider logger: level=debug
2024-01-25T14:29:27.494+0700 [INFO]  provider: configuring client automatic mTLS
2024-01-25T14:29:27.504+0700 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3 args=[".terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3"]
2024-01-25T14:29:27.506+0700 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3 pid=34791
2024-01-25T14:29:27.506+0700 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3
2024-01-25T14:29:27.515+0700 [INFO]  provider.terraform-provider-idcloudhost_v0.1.3: configuring server automatic mTLS: timestamp="2024-01-25T14:29:27.515+0700"
2024-01-25T14:29:27.530+0700 [DEBUG] provider: using plugin: version=5
2024-01-25T14:29:27.530+0700 [DEBUG] provider.terraform-provider-idcloudhost_v0.1.3: plugin address: network=unix address=/var/folders/dv/4crct9n51db98y97snt9cxp00000gn/T/plugin2758698878 timestamp="2024-01-25T14:29:27.530+0700"
2024-01-25T14:29:27.541+0700 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-01-25T14:29:27.542+0700 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3 pid=34791
2024-01-25T14:29:27.542+0700 [DEBUG] provider: plugin exited
2024-01-25T14:29:27.542+0700 [DEBUG] Building and walking validate graph
2024-01-25T14:29:27.542+0700 [DEBUG] ProviderTransformer: "idcloudhost_floating_ip.testip" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/bapung/idcloudhost"]
2024-01-25T14:29:27.542+0700 [DEBUG] ProviderTransformer: "idcloudhost_vm.testvm" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/bapung/idcloudhost"]
2024-01-25T14:29:27.543+0700 [DEBUG] ReferenceTransformer: "idcloudhost_vm.testvm" references: []
2024-01-25T14:29:27.543+0700 [DEBUG] ReferenceTransformer: "idcloudhost_floating_ip.testip" references: []
2024-01-25T14:29:27.543+0700 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/bapung/idcloudhost\"]" references: []
2024-01-25T14:29:27.543+0700 [DEBUG] Starting graph walk: walkValidate
2024-01-25T14:29:27.543+0700 [DEBUG] created provider logger: level=debug
2024-01-25T14:29:27.543+0700 [INFO]  provider: configuring client automatic mTLS
2024-01-25T14:29:27.547+0700 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3 args=[".terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3"]
2024-01-25T14:29:27.549+0700 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3 pid=34792
2024-01-25T14:29:27.549+0700 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3
2024-01-25T14:29:27.558+0700 [INFO]  provider.terraform-provider-idcloudhost_v0.1.3: configuring server automatic mTLS: timestamp="2024-01-25T14:29:27.558+0700"
2024-01-25T14:29:27.573+0700 [DEBUG] provider.terraform-provider-idcloudhost_v0.1.3: plugin address: address=/var/folders/dv/4crct9n51db98y97snt9cxp00000gn/T/plugin1884969823 network=unix timestamp="2024-01-25T14:29:27.573+0700"
2024-01-25T14:29:27.573+0700 [DEBUG] provider: using plugin: version=5
2024-01-25T14:29:27.585+0700 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-01-25T14:29:27.586+0700 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3 pid=34792
2024-01-25T14:29:27.586+0700 [DEBUG] provider: plugin exited
2024-01-25T14:29:27.586+0700 [INFO]  backend/local: apply calling Plan
2024-01-25T14:29:27.586+0700 [DEBUG] Building and walking plan graph for NormalMode
2024-01-25T14:29:27.586+0700 [DEBUG] ProviderTransformer: "idcloudhost_vm.testvm (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/bapung/idcloudhost"]
2024-01-25T14:29:27.586+0700 [DEBUG] ProviderTransformer: "idcloudhost_floating_ip.testip (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/bapung/idcloudhost"]
2024-01-25T14:29:27.586+0700 [DEBUG] ReferenceTransformer: "idcloudhost_vm.testvm (expand)" references: []
2024-01-25T14:29:27.586+0700 [DEBUG] ReferenceTransformer: "idcloudhost_floating_ip.testip (expand)" references: []
2024-01-25T14:29:27.586+0700 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/bapung/idcloudhost\"]" references: []
2024-01-25T14:29:27.586+0700 [DEBUG] Starting graph walk: walkPlan
2024-01-25T14:29:27.586+0700 [DEBUG] created provider logger: level=debug
2024-01-25T14:29:27.586+0700 [INFO]  provider: configuring client automatic mTLS
2024-01-25T14:29:27.591+0700 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3 args=[".terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3"]
2024-01-25T14:29:27.592+0700 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3 pid=34793
2024-01-25T14:29:27.592+0700 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3
2024-01-25T14:29:27.602+0700 [INFO]  provider.terraform-provider-idcloudhost_v0.1.3: configuring server automatic mTLS: timestamp="2024-01-25T14:29:27.602+0700"
2024-01-25T14:29:27.617+0700 [DEBUG] provider.terraform-provider-idcloudhost_v0.1.3: plugin address: address=/var/folders/dv/4crct9n51db98y97snt9cxp00000gn/T/plugin4059461297 network=unix timestamp="2024-01-25T14:29:27.617+0700"
2024-01-25T14:29:27.617+0700 [DEBUG] provider: using plugin: version=5
2024-01-25T14:29:27.627+0700 [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/bapung/idcloudhost\"]" changed the config value, but that value is unused
2024-01-25T14:29:27.886+0700 [DEBUG] Resource instance state not found for node "idcloudhost_floating_ip.testip", instance idcloudhost_floating_ip.testip
2024-01-25T14:29:27.886+0700 [DEBUG] ReferenceTransformer: "idcloudhost_floating_ip.testip" references: []
2024-01-25T14:29:27.887+0700 [DEBUG] Resource instance state not found for node "idcloudhost_vm.testvm", instance idcloudhost_vm.testvm
2024-01-25T14:29:27.887+0700 [DEBUG] ReferenceTransformer: "idcloudhost_vm.testvm" references: []
2024-01-25T14:29:27.887+0700 [DEBUG] refresh: idcloudhost_floating_ip.testip: no state, so not refreshing
2024-01-25T14:29:27.887+0700 [DEBUG] refresh: idcloudhost_vm.testvm: no state, so not refreshing
2024-01-25T14:29:27.894+0700 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-01-25T14:29:27.896+0700 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3 pid=34793
2024-01-25T14:29:27.896+0700 [DEBUG] provider: plugin exited
2024-01-25T14:29:27.896+0700 [DEBUG] building apply graph to check for errors
2024-01-25T14:29:27.896+0700 [DEBUG] Resource state not found for node "idcloudhost_floating_ip.testip", instance idcloudhost_floating_ip.testip
2024-01-25T14:29:27.896+0700 [DEBUG] Resource state not found for node "idcloudhost_vm.testvm", instance idcloudhost_vm.testvm
2024-01-25T14:29:27.896+0700 [DEBUG] ProviderTransformer: "idcloudhost_floating_ip.testip (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/bapung/idcloudhost"]
2024-01-25T14:29:27.896+0700 [DEBUG] ProviderTransformer: "idcloudhost_floating_ip.testip" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/bapung/idcloudhost"]
2024-01-25T14:29:27.896+0700 [DEBUG] ProviderTransformer: "idcloudhost_vm.testvm" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/bapung/idcloudhost"]
2024-01-25T14:29:27.896+0700 [DEBUG] ProviderTransformer: "idcloudhost_vm.testvm (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/bapung/idcloudhost"]
2024-01-25T14:29:27.897+0700 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/bapung/idcloudhost\"]" references: []
2024-01-25T14:29:27.897+0700 [DEBUG] ReferenceTransformer: "idcloudhost_vm.testvm (expand)" references: []
2024-01-25T14:29:27.897+0700 [DEBUG] ReferenceTransformer: "idcloudhost_floating_ip.testip (expand)" references: []
2024-01-25T14:29:27.897+0700 [DEBUG] ReferenceTransformer: "idcloudhost_floating_ip.testip" references: []
2024-01-25T14:29:27.897+0700 [DEBUG] ReferenceTransformer: "idcloudhost_vm.testvm" references: []

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with
the following symbols:
  + create

Terraform will perform the following actions:

  # idcloudhost_floating_ip.testip will be created
  + resource "idcloudhost_floating_ip" "testip" {
      + address            = (known after apply)
      + billing_account_id = 1337
      + created_at         = (known after apply)
      + enabled            = (known after apply)
      + id                 = (known after apply)
      + name               = "my_test_ip"
      + network_id         = (known after apply)
      + type               = (known after apply)
      + updated_at         = (known after apply)
      + user_id            = (known after apply)
    }

  # idcloudhost_vm.testvm will be created
  + resource "idcloudhost_vm" "testvm" {
      + backup             = false
      + billing_account_id = 1200148739
      + created_at         = (known after apply)
      + disks              = 20
      + hostname           = (known after apply)
      + hypervisor_id      = (known after apply)
      + id                 = (known after apply)
      + initial_password   = (sensitive value)
      + mac                = (known after apply)
      + memory             = 1024
      + name               = "testvm"
      + os_name            = "ubuntu"
      + os_version         = "18.04"
      + private_ipv4       = (known after apply)
      + status             = (known after apply)
      + storage            = (known after apply)
      + tags               = (known after apply)
      + updated_at         = (known after apply)
      + user_id            = (known after apply)
      + username           = "example"
      + uuid               = (known after apply)
      + vcpu               = 1
    }

Plan: 2 to add, 0 to change, 0 to destroy.
2024-01-25T14:29:27.899+0700 [INFO]  backend/local: apply calling Apply
2024-01-25T14:29:27.899+0700 [DEBUG] Building and walking apply graph for NormalMode plan
2024-01-25T14:29:27.899+0700 [DEBUG] Resource state not found for node "idcloudhost_floating_ip.testip", instance idcloudhost_floating_ip.testip
2024-01-25T14:29:27.899+0700 [DEBUG] Resource state not found for node "idcloudhost_vm.testvm", instance idcloudhost_vm.testvm
2024-01-25T14:29:27.899+0700 [DEBUG] ProviderTransformer: "idcloudhost_floating_ip.testip (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/bapung/idcloudhost"]
2024-01-25T14:29:27.899+0700 [DEBUG] ProviderTransformer: "idcloudhost_vm.testvm (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/bapung/idcloudhost"]
2024-01-25T14:29:27.899+0700 [DEBUG] ProviderTransformer: "idcloudhost_floating_ip.testip" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/bapung/idcloudhost"]
2024-01-25T14:29:27.899+0700 [DEBUG] ProviderTransformer: "idcloudhost_vm.testvm" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/bapung/idcloudhost"]
2024-01-25T14:29:27.899+0700 [DEBUG] ReferenceTransformer: "idcloudhost_vm.testvm" references: []
2024-01-25T14:29:27.899+0700 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/bapung/idcloudhost\"]" references: []
2024-01-25T14:29:27.899+0700 [DEBUG] ReferenceTransformer: "idcloudhost_floating_ip.testip (expand)" references: []
2024-01-25T14:29:27.899+0700 [DEBUG] ReferenceTransformer: "idcloudhost_vm.testvm (expand)" references: []
2024-01-25T14:29:27.899+0700 [DEBUG] ReferenceTransformer: "idcloudhost_floating_ip.testip" references: []
2024-01-25T14:29:27.900+0700 [DEBUG] Starting graph walk: walkApply
2024-01-25T14:29:27.900+0700 [DEBUG] created provider logger: level=debug
2024-01-25T14:29:27.900+0700 [INFO]  provider: configuring client automatic mTLS
2024-01-25T14:29:27.908+0700 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3 args=[".terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3"]
2024-01-25T14:29:27.910+0700 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3 pid=34794
2024-01-25T14:29:27.910+0700 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3
2024-01-25T14:29:27.923+0700 [INFO]  provider.terraform-provider-idcloudhost_v0.1.3: configuring server automatic mTLS: timestamp="2024-01-25T14:29:27.923+0700"
2024-01-25T14:29:27.940+0700 [DEBUG] provider: using plugin: version=5
2024-01-25T14:29:27.940+0700 [DEBUG] provider.terraform-provider-idcloudhost_v0.1.3: plugin address: address=/var/folders/dv/4crct9n51db98y97snt9cxp00000gn/T/plugin629163425 network=unix timestamp="2024-01-25T14:29:27.940+0700"
2024-01-25T14:29:27.950+0700 [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/bapung/idcloudhost\"]" changed the config value, but that value is unused
idcloudhost_floating_ip.testip: Creating...
2024-01-25T14:29:28.621+0700 [INFO]  Starting apply for idcloudhost_floating_ip.testip
2024-01-25T14:29:28.621+0700 [DEBUG] idcloudhost_floating_ip.testip: applying the planned Create change
idcloudhost_vm.testvm: Creating...
2024-01-25T14:29:28.621+0700 [INFO]  Starting apply for idcloudhost_vm.testvm
2024-01-25T14:29:28.622+0700 [DEBUG] idcloudhost_vm.testvm: applying the planned Create change
2024-01-25T14:29:28.623+0700 [INFO]  provider.terraform-provider-idcloudhost_v0.1.3: 2024/01/25 14:29:28 [DEBUG] setting computed for "tags" from ComputedKeys: timestamp="2024-01-25T14:29:28.623+0700"
2024-01-25T14:29:28.623+0700 [INFO]  provider.terraform-provider-idcloudhost_v0.1.3: 2024/01/25 14:29:28 [DEBUG] setting computed for "storage" from ComputedKeys: timestamp="2024-01-25T14:29:28.623+0700"
2024-01-25T14:29:28.655+0700 [ERROR] provider.terraform-provider-idcloudhost_v0.1.3: Response contains error diagnostic: tf_provider_addr=provider tf_resource_type=idcloudhost_floating_ip diagnostic_severity=ERROR diagnostic_summary="Empty Summary: This is always a bug in the provider and should be reported to the provider developers." tf_proto_version=5.3 tf_rpc=ApplyResourceChange @caller=github.com/hashicorp/terraform-plugin-go@v0.14.0/tfprotov5/internal/diag/diagnostics.go:55 @module=sdk.proto diagnostic_detail="" tf_req_id=71958f5e-8114-448b-8db3-b1ef069e9e19 timestamp="2024-01-25T14:29:28.655+0700"
2024-01-25T14:29:28.665+0700 [DEBUG] State storage *statemgr.Filesystem declined to persist a state snapshot
2024-01-25T14:29:28.665+0700 [ERROR] vertex "idcloudhost_floating_ip.testip" error: Empty Summary: This is always a bug in the provider and should be reported to the provider developers.
2024-01-25T14:29:28.841+0700 [ERROR] provider.terraform-provider-idcloudhost_v0.1.3: Response contains error diagnostic: diagnostic_severity=ERROR tf_proto_version=5.3 tf_resource_type=idcloudhost_vm tf_rpc=ApplyResourceChange tf_provider_addr=provider @caller=github.com/hashicorp/terraform-plugin-go@v0.14.0/tfprotov5/internal/diag/diagnostics.go:55 diagnostic_detail="" @module=sdk.proto diagnostic_summary="Unable to create new VM" tf_req_id=bea77307-2e6b-ed3d-3857-bedeb0fb142b timestamp="2024-01-25T14:29:28.841+0700"
2024-01-25T14:29:28.846+0700 [DEBUG] State storage *statemgr.Filesystem declined to persist a state snapshot
2024-01-25T14:29:28.846+0700 [ERROR] vertex "idcloudhost_vm.testvm" error: Unable to create new VM
╷
│ Error: Unable to create new VM
│ 
│   with idcloudhost_vm.testvm,
│   on main.tf line 14, in resource "idcloudhost_vm" "testvm":
│   14: resource "idcloudhost_vm" "testvm" {
│ 
╵
╷
│ Error: Empty Summary: This is always a bug in the provider and should be reported to the provider developers.
│ 
│   with idcloudhost_floating_ip.testip,
│   on main.tf line 27, in resource "idcloudhost_floating_ip" "testip":
│   27: resource "idcloudhost_floating_ip" "testip" {
│ 
╵
2024-01-25T14:29:28.857+0700 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-01-25T14:29:28.860+0700 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/bapung/idcloudhost/0.1.3/darwin_arm64/terraform-provider-idcloudhost_v0.1.3 pid=34794
2024-01-25T14:29:28.860+0700 [DEBUG] provider: plugin exited
```